// 0. Напишите программу, которая на вход принимает число и
//    выдаёт его квадрат (число умноженное на само себя).



System.Console.WriteLine("Введите число: ");
int num = int.Parse(Console.ReadLine()!);
System.Console.WriteLine(num * num);